{ "process_id":"bib01",
"element_outer_html":"<ref>A. Paivio, B. Jansen, L.J. Becker, Comparisons through the mind&#x2019;s eye, Cognition 37 (2) (1975) 635–647.</ref>"
},

{ "process_id":"bib02",
"element_outer_html":"<ref>Paivio, A., Jansen, B., Becker, L.J., 1975. Comparisons through the mind&#x2019;s eye. Cognition 37 (2), 635–647</ref>"
},

{ "process_id":"bib03",
"element_outer_html":"<ref>Paivio A, Jansen B, Becker LJ. Comparisons through the mind&#x2019;s eye. Cognition 1975;37(2):635–47.</ref>"
},

{ "process_id":"bib04",
"element_outer_html":"<ref>Paivio A, Jansen B, Becker LJ. Comparisons through the mind&#x2019;s eye. Cognition 1975;37(2):635–47.</ref>"
},

{ "process_id":"bib05",
"element_outer_html":"<ref>Paivio, A., Jansen, B., &#x0026; Becker, L. J. (1975). Comparisons through the mind&#x2019;s eye. Cognition, 37(2), 635–647.</ref>"
},

{ "process_id":"bib06",
"element_outer_html":"<ref>Paivio, A.; Jansen, B.; Becker, L. J. Comparisons Through the Mind’s Eye. Cognition 1975, 37 (2), 635–647.</ref>"
},

{ "process_id":"bib07",
"element_outer_html":"<ref>A.W.C. Yuen, Lamotrigine: a review of antiepileptic efficacy, Epilepsia 35 (Suppl. 5) (1994) S33–S36.</ref>"
},

{ "process_id":"bib08",
"element_outer_html":"<ref>Yuen AWC. Lamotrigine: a review of antiepileptic efficacy. Epilepsia 1994;<b>35</b>(Suppl. 5):S33–6.</ref>"
},

{ "process_id":"bib09",
"element_outer_html":"<ref>Yuen, A. W. C. Lamotrigine: A Review of Antiepileptic Efficacy. Epilepsia <b>1994</b>, 35 (Suppl. 5), S33–S36.</ref>"
},

{ "process_id":"bib10",
"element_outer_html":"<ref>R. Glaser, L. Bond (Eds.), Testing: Concepts and Research, Am. Psychol. 36 (10) (1981) (special issue).</ref>"
},

{ "process_id":"bib11",
"element_outer_html":"<ref>Glaser, R., Bond, L. (Eds.), 1981. Testing: Concepts and Research. Am. Psychol. 36 (10) (special issue).</ref>"
},

{ "process_id":"bib12",
"element_outer_html":"<ref>Glaser, R., &#x0026; Bond, L. (Eds.). (1981). Testing: Concepts and research [Special issue]. American Psychologist, 36(10).</ref>"
},

{ "process_id":"bib13",
"element_outer_html":"<ref>E.H.M. Assink, N. Verloop, Het aanleren van deel–geheel relaties (Teaching part–whole relations), Pedagogische Studiën 54 (1977) 130–142 (in Dutch).</ref>"
},

{ "process_id":"bib14",
"element_outer_html":"<ref>H1 Collaboration, Nucl. Phys. B 504 (1997) 3.</ref>"
},

{ "process_id":"bib15",
"element_outer_html":"<ref>H1 Collaboration. (1997). Nuclear Physics B, 504, 3.</ref>"
},

{ "process_id":"bib16",
"element_outer_html":"<ref>S. Weikert, D. Freyer, M. Weih, N. Isaev, C. Busch, J. Schultze, et al., Rapid Ca2+-dependent NO-production from central nervous system cells in culture measured by NO-nitrite/ozone chemoluminescence, Brain Res. 748 (1997) 1–11.</ref>"
},

{ "process_id":"bib17",
"element_outer_html":"<ref>Nelissen, N., Pazzaglia, M., Vandenbulcke, M., Sunaert., S, Fannes., K., Dupont., P., … Vandenberghe, R. (2010). Gesture discrimination in primary progressive aphasia: The intersection between gesture and language processing pathways. Journal of Neuroscience, 30(18), 6334–6341.</ref>"
},

{ "process_id":"bib18",
"element_outer_html":"<ref>Sheen J. C4 gene expression. Ann Rev Plant Physiol Plant Mol Biol. 1999a;50: 187–217.</ref>"
},

{ "process_id":"bib19",
"element_outer_html":"<ref>Sheen, J., 1999a. C4 gene expression. Annu. Rev. Plant Physiol. Plant Mol. Biol. 50, 187–217.</ref>"
},

{ "process_id":"bib20",
"element_outer_html":"<ref>J.C. VanDecar, R.M. Russo, D.E. James, W.B. Ambeh, M. Franke, Aseismic continuation of the Lesser Antilles slab beneath northeastern Venezuela. J. Geophys. Res. 108 (2003) 2043, doi:10.1029/2001JB000884.</ref>"
},

{ "process_id":"bib21",
"element_outer_html":"<ref>C. James, K. Davis, L. Charmaraman, S. Konrath, P. Slovak, E. Weinstein, L. Yarosh, Digital life and youth well-being, social connectedness, empathy, and narcissism, Pediatrics 140 (Supplement 2) (2017) S71-S75.</ref>"
},

{ "process_id":"bib22",
"element_outer_html":"<ref>B.M. Titus, M. Daly, D.A. Exton, Do reef fish habituate to diver presence? Evidence from two reef sites with contrasting historical levels of SCUBA intensity in the Bay Islands, Honduras, PLOS ONE 10 (2015) e0119645</ref>"
},

{ "process_id":"2022Groupbased",
"element_outer_html":"<ref>X. Bai, A. Fielbaum, M. Kronm&#x00FC;ller, L. Knoedler, and J. Alonso-Mora, Group-based distributed auction algorithms for multi-robot task assignment, IEEE Transactions on Automation Science and Engineering, vol. 20, no. 2, pp. 1292&#x2013;1303, 2023.</ref>"
},

{ "process_id":"2022Groupbaseda",
"element_outer_html":"<ref>X. Bai, A. Fielbaum, M. Kronm&#x00FC;ller, L. Knoedler, and J. Alonso-Mora, Group-based distributed auction algorithms for multi-robot task assignment, IEEE Transactions on Automation Science and Engineering, <b>20</b>(2), 1292&#x2013;1303, 2023.</ref>"
},

{ "process_id":"2022Groupbasedb",
"element_outer_html":"<ref>X. Bai, A. Fielbaum, M. Kronm&#x00FC;ller, L. Knoedler, and J. Alonso-Mora, Group-based distributed auction algorithms for multi-robot task assignment, IEEE Transactions on Automation Science and Engineering, vol. <b>20</b>(2), 12921303, 2023.</ref>"
},

{ "process_id":"2022Temporal",
"element_outer_html":"<ref>X. Luo and M. M. Zavlanos: Temporal logic task allocation in heterogeneous multirobot systems, IEEE Transactions on Robotics, vol. 38, no. 6, pp. 3602&#x2013;3621, (2022).</ref>"
},

{ "process_id":"2016AnEstimation",
"element_outer_html":"<ref>S.-Y. Wang and L. Wang, An estimation of distribution algorithm-based memetic algorithm for the distributed assembly permutation flow-shop scheduling problem, IEEE Transactions on Systems, Man, and Cybernetics: Systems, 46(1), p. 139&#x2013;149, (2016).</ref>"
},

{ "process_id":"2018Distributedtask",
"element_outer_html":"<ref>L. Jin and S. Li, Distributed task allocation of multiple robots: A control perspective, IEEE Transactions on Systems, Man, and Cybernetics: Systems, vol. 48, no. 5, pp. 693&#x2013;701, 2018.</ref>"
},

{ "process_id":"2022ACHORD",
"element_outer_html":"<ref>M. Saboia, L. Clark, V. Thangavelu, J. A. Edlund, K. Otsu, G. J. Correa, V. S. Varadharajan, A. Santamaria-Navarro, T. Touma, A. Bouman et al., Achord: Communication-aware multi-robot coordination with intermittent connectivity, IEEE Robotics and Automation Letters, vol. 7, no. 4, pp. 10184&#x2013;10191, 2022.</ref>"
},

{ "process_id":"2022Distributed",
"element_outer_html":"<ref>X. Bai, W. Yan, and S. S. Ge, Distributed task assignment for multiple robots under limited communication range, IEEE Transactions on Systems, Man, and Cybernetics: Systems, vol. 52, no. 7, pp. 4259&#x2013;4271, 2022.</ref>"
},

{ "process_id":"2018Anintegrated",
"element_outer_html":"<ref>X. Bai, W. Yan, S. S. Ge, and M. Cao, An integrated multi-population genetic algorithm for multi-vehicle task assignment in a drift field,&#x201D; Information Sciences, vol. 453, pp. 227&#x2013;238, 2018.</ref>"
},

{ "process_id":"2014Vehicle",
"element_outer_html":"<ref>P. Toth and D. Vigo, Vehicle routing: problems, methods, and applications. SIAM, 2014.</ref>"
},

{ "process_id":"2020Truck-drone",
"element_outer_html":"<ref>P. L. Gonzalez-R, D. Canca, J. L. Andrade-Pineda, M. Calle, and J. M. Leon-Blanco, Truck-drone team logistics: A heuristic approach to multi-drop route planning, Transportation Research Part C: Emerging Technologies, vol. 114, pp. 657&#x2013;680, 2020.</ref>"
},

{ "process_id":"2019Routing",
"element_outer_html":"<ref>D. Wang, P. Hu, J. Du, P. Zhou, T. Deng, and M. Hu, Routing and scheduling for hybrid truck-drone collaborative parcel delivery with independent and truck-carried drones, IEEE Internet of Things Journal, vol. 6, no. 6, pp. 10483&#x2013;10495, 2019.</ref>"
},

{ "process_id":"2015The",
"element_outer_html":"<ref>C. C. Murray and A. G. Chu, The flying sidekick traveling salesman problem: Optimization of drone-assisted parcel delivery, Transportation Research Part C: Emerging Technologies, vol. 54, pp. 86&#x2013;109, 2015.</ref>"
},

{ "process_id":"2018Adeomposition",
"element_outer_html":"<ref>E. E. Yurek and H. C. Ozmutlu, A decomposition-based iterative optimization algorithm for traveling salesman problem with drone, Transportation Research Part C: Emerging Technologies, vol. 91, pp. 249&#x2013;262, 2018.</ref>"
},

{ "process_id":"2015Planning",
"element_outer_html":"<ref>N. Mathew, S. L. Smith, and S. L. Waslander, Planning paths for package delivery in heterogeneous multirobot teams, IEEE Transactions on Automation Science and Engineering, vol. 12, no. 4, pp. 1298&#x2013;1308, 2015.</ref>"
},

{ "process_id":"2020A",
"element_outer_html":"<ref>M. Moshref-Javadi, A. Hemmati, and M. Winkenbach, A truck and drones model for last-mile delivery: A mathematical model and heuristic approach, Applied Mathematical Modelling, vol. 80, pp. 290&#x2013;318, 2020.</ref>"
},

{ "process_id":"2019An",
"element_outer_html":"<ref>D. Sacramento, D. Pisinger, and S. Ropke, An adaptive large neighborhood search metaheuristic for the vehicle routing problem with drones,&#x201D; Transportation Research Part C: Emerging Technologies, vol. 102, pp. 289&#x2013;315, 2019.</ref>"
},

{ "process_id":"2018Optimal",
"element_outer_html":"<ref>Y. S. Chang and H. J. Lee, Optimal delivery routing with wider drone-delivery areas along a shorter truck-route, Expert Systems with Applications, vol. 104, pp. 307&#x2013;317, 2018.</ref>"
},

{ "process_id":"1995The",
"element_outer_html":"<ref>M. W. Savelsbergh and M. Sol, The general pickup and delivery problem,&#x201D; Transportation Science, vol. 29, no. 1, pp. 17&#x2013;29, 1995.</ref>"
},

{ "process_id":"2008A",
"element_outer_html":"<ref>S. N. Parragh, K. F. Doerner, and R. F. Hartl, A survey on pickup and delivery problems, Journal f&#x00FC;r Betriebswirtschaft, vol. 58, no. 1, pp. 21&#x2013;51, 2008.</ref>"
},

{ "process_id":"2012Precedence",
"element_outer_html":"<ref>M. Nowak, M. Hewitt, and C. C. White III, Precedence constrained pickup and delivery with split loads, International Journal of Logistics Research and Applications, vol. 15, no. 1, pp. 1&#x2013;14, 2012.</ref>"
},

{ "process_id":"2005A",
"element_outer_html":"<ref>G. Pankratz, A grouping genetic algorithm for the pickup and delivery problem with time windows, Or Spectrum, vol. 27, no. 1, pp. 21&#x2013;41, 2005.</ref>"
},

{ "process_id":"2021Waiting",
"element_outer_html":"<ref>H. Park, D. Son, B. Koo, and B. Jeong, Waiting strategy for the vehicle routing problem with simultaneous pickup and delivery using genetic algorithm, Expert Systems with Applications, vol. 165, p. 113959, 2021.</ref>"
},

{ "process_id":"2013The",
"element_outer_html":"<ref>F. A. Santos, G. R. Mateus, and A. S. Da Cunha, The pickup and delivery problem with cross-docking, Computers &#x0026; Operations Research, vol. 40, no. 4, pp. 1085&#x2013;1093, 2013.</ref>"
},

{ "process_id":"2007An",
"element_outer_html":"<ref>E. Cao and M. Lai, An improved differential evolution algorithm for the vehicle routing problem with simultaneous delivery and pick-up service, in Third International Conference on Natural Computation (ICNC 2007), vol. 3.IEEE, 2007, pp. 436&#x2013;440.</ref>"
},

{ "process_id":"2016A",
"element_outer_html":"<ref>H. Hern&#x00E1;ndez-P&#x00E9;rez, I. Rodr&#x00ED;guez-Mart&#x00ED;n, and J.-J. Salazar-Gonz&#x00E1;lez, A hybrid heuristic approach for the multi-commodity pickup-and-delivery traveling salesman problem, European Journal of Operational Research, vol. 251, no. 1, pp. 44&#x2013;52, 2016.</ref>"
},

{ "process_id":"2022A",
"element_outer_html":"<ref>Z. Luo, R. Gu, M. Poon, Z. Liu, and A. Lim, A last-mile drone-assisted one-to-one pickup and delivery problem with multi-visit drone trips,&#x201D; Computers &#x0026; Operations Research, vol. 148, p. 106015, 2022.</ref>"
},

{ "process_id":"2003Combinatorial",
"element_outer_html":"<ref>L. Rabiner, Combinatorial optimization:algorithms and complexity,&#x201D; IEEE Transactions on Acoustics Speech &#x0026; Signal Processing, vol. 32, no. 6, pp. 1258&#x2013;1259, 2003.</ref>"
},

{ "process_id":"2019Efficient",
"element_outer_html":"<ref>X. Bai, M. Cao, W. Yan, and S. S. Ge, Efficient routing for precedence-constrained package delivery for heterogeneous vehicles,&#x201D; IEEE Transactions on Automation Science and Engineering, vol. 17, no. 1, pp. 248&#x2013;260, 2020.</ref>"
},

{ "process_id":"2019The",
"element_outer_html":"<ref>A. Karak and K. Abdelghany, The hybrid vehicle-drone routing problem for pick-up and delivery services, Transportation Research Part C: Emerging Technologies, vol. 102, pp. 427&#x2013;449, 2019.</ref>"
},

{ "process_id":"2017Clustering-based",
"element_outer_html":"<ref>X. Bai, W. Yan, and M. Cao, Clustering-based algorithms for multivehicle task assignment in a time-invariant drift field, IEEE Robotics and Automation Letters, vol. 2, no. 4, pp. 2166&#x2013;2173, 2017.</ref>"
},

{ "process_id":"1968optimum",
"element_outer_html":"<ref>J. Edmonds, Optimum branchings, Mathematics and the Decision Sciences, Part, vol. 1, no. 335-345, p. 25, 1968.</ref>"
},

{ "process_id":"1964Scheduling",
"element_outer_html":"<ref>G. Clarke and J. W. Wright, Scheduling of vehicles from a central depot to a number of delivery points, Operations Research, vol. 12, no. 4, pp. 568&#x2013;581, 1964.</ref>"
}